<a href="https://colab.research.google.com/github/blankon123/random-analytics/blob/main/Scikit_101.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## Load Libriaries

In [4]:
from sklearn import datasets
from sklearn import linear_model
from sklearn.metrics import mean_squared_error

import numpy as np
import pandas as pd

## Download Kaggle Data

In [11]:
#Download dataset dari kaggle
from google.colab import files
from IPython.display import clear_output

files.upload()

! pip install -q kaggle
! mkdir ~/.kaggle
! cp kaggle.json ~/.kaggle/
! chmod 600 ~/.kaggle/kaggle.json
! kaggle competitions download -c bigdata-bps-hackathon-2021

clear_output()
!ls /content

Deskripsi%20Data%20TPK.docx  test-online_booking_2021.csv
kaggle.json		     test-TPK_Hotel_berbintang_2021.csv
sample_data		     train-online_booking_2020.csv
sample-submission.csv	     train-TPK_Hotel_berbintang_2020.csv

## Load Data

### Training Data

In [16]:
train_online = pd.read_csv('train-online_booking_2020.csv')
train_online.head(10)

  province   type   tanggal klasifikasi  all_available_room  room_total
0     Bali  Hotel  1/1/2020       Rated                2155       37756
1     Bali  Hotel  1/1/2020   Not Rated                 163         392
2     Bali  Hotel  1/2/2020       Rated                3878       38814
3     Bali  Hotel  1/2/2020   Not Rated                 211         415
4     Bali  Hotel  1/3/2020       Rated                5412       39084
5     Bali  Hotel  1/3/2020   Not Rated                 256         444
6     Bali  Hotel  1/4/2020       Rated                7786       39310
7     Bali  Hotel  1/4/2020   Not Rated                 306         483
8     Bali  Hotel  1/5/2020       Rated                7956       39334
9     Bali  Hotel  1/5/2020   Not Rated                 273         448

In [17]:
train_online.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 696 entries, 0 to 695
Data columns (total 6 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   province            696 non-null    object
 1   type                696 non-null    object
 2   tanggal             696 non-null    object
 3   klasifikasi         696 non-null    object
 4   all_available_room  696 non-null    int64
 5   room_total          696 non-null    int64
dtypes: int64(2), object(4)
memory usage: 32.8+ KB

In [26]:
train_bps = pd.read_csv('train-TPK_Hotel_berbintang_2020.csv')
train_bps.head()

   Id Provinsi  Tahun     Bulan  Aggregate_var    TPK
0   1     Bali   2020   Januari            NaN  59.29
1   2     Bali   2020  Februari            NaN  45.98
2   3     Bali   2020     Maret            NaN  25.41
3   4     Bali   2020     April            NaN   3.22
4   5     Bali   2020       Mei            NaN   2.07

In [19]:
train_bps.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Id             12 non-null     int64
 1   Provinsi       12 non-null     object
 2   Tahun          12 non-null     int64
 3   Bulan          12 non-null     object
 4   Aggregate_var  0 non-null      float64
 5   TPK            12 non-null     float64
dtypes: float64(2), int64(2), object(2)
memory usage: 704.0+ bytes

## Testing Data

In [21]:
test_bps = pd.read_csv('test-TPK_Hotel_berbintang_2021.csv')
test_bps

   Id Provinsi  Tahun     Bulan  Aggregate  TPK
0   1     BALI   2021   Januari        NaN  NaN
1   2     BALI   2021  Februari        NaN  NaN
2   3     BALI   2021     Maret        NaN  NaN
3   4     BALI   2021     April        NaN  NaN
4   5     BALI   2021       Mei        NaN  NaN
5   6     BALI   2021      Juni        NaN  NaN

In [28]:
test_online = pd.read_csv('test-online_booking_2021.csv')
test_online.head()

  province   type   tanggal klasifikasi  all_available_room  room_total
0     Bali  Hotel  1/1/2021       Rated               31334       54852
1     Bali  Hotel  1/1/2021   Not Rated                 618         702
2     Bali  Hotel  1/2/2021       Rated               33698       55950
3     Bali  Hotel  1/2/2021   Not Rated                 642         705
4     Bali  Hotel  1/3/2021       Rated               33310       55380

In [29]:
test_online.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 356 entries, 0 to 355
Data columns (total 6 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   province            356 non-null    object
 1   type                356 non-null    object
 2   tanggal             356 non-null    object
 3   klasifikasi         356 non-null    object
 4   all_available_room  356 non-null    int64
 5   room_total          356 non-null    int64
dtypes: int64(2), object(4)
memory usage: 16.8+ KB

### Submission

In [24]:
submission = pd.read_csv('sample-submission.csv')
submission

   Id    TPK
0   1  14.55
1   2   7.99
2   3   8.56
3   4   9.01
4   5   8.65
5   6  18.56